Revit 2026 API

# EnergyAnalysisDetailModelTransformModel Method

---

Transforms all surfaces in the model according to the document's active ground plane, shared coordinates and true north.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void TransformModel()
```
```vb
Public Sub TransformModel
```
```cpp
public:
void TransformModel()
```
```fsharp
member TransformModel : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This operation failed. |

#### Reference

EnergyAnalysisDetailModel Class

Autodesk.Revit.DB.Analysis Namespace